Python 3.9.4 (tags/v3.9.4:1f2e308, Apr  6 2021, 13:40:21) [MSC v.1928 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
== RESTART: C:\Users\moses\OneDrive\Documents\Code\Python\ArialArm To Arial.py =
27
1. Գեթսեման պարտեզ մտեք Դուք դեւեն փորձվածներ, Ձեր Տիրոջ պայքարն տեսեք, 
Այն խիստ ահավոր գիշեր, Իր ցավեն ետ մի քաշվիք, Որ աղոթք ընել սորվիք: 
2. Մոտեցեք այն ատեանին, Ուր փառաց Տերն կանարգվի, Նայեցեք Անոր վշտին, 
Ի՜նչ ցավով սիրտն կլեցվի, Դուն ալ մի քաշվիր ցավեն Խաչդ կրել սորվե Իրմե: 
3. Գողգոթան ի վեր ելեք, Հոն Անոր ոտքերն գրկած՝ Այս անհուն հրաշքն տեսեք, 
Աստծո որդին զոհված: «Կատարյալ է»,- կգոչե, Սորվեցեք մեռնիլ Անկե: 
4. Գերեզմանը մոտեցեք, Ուր մարմինը թաղվեցավ, Այն դատարկ է, նայեցեք, 
Ո՞վ ըզ Տերն անկե առավ: Տերն հարյավ ու համբարձավ, Մեզ ալ նույն խոստմունք տվավ: 
>>> 
== RESTART: C:\Users\moses\OneDrive\Documents\Code\Python\ArialArm To Arial.py =
27
1. Գեթսեման պարտեզ մտեք 
Դուք դեւեն փորձվածներ, 
Ձեր Տիրոջ պայքարն տեսեք, 
Այն խիստ ահավոր գիշեր, 
Իր ցավեն ետ մի քաշվիք, 
Որ աղոթք ընել սորվիք: 
2. Մոտեցեք այն ատեանին, 
Ուր փառաց Տերն կանարգվի, 
Նայեցեք Անոր վշտին, 
Ի՜նչ ցավով սիրտն կլեցվի, 
Դուն ալ մի քաշվիր ցավեն 
Խաչդ կրել սորվե Իրմե: 
3. Գողգոթան ի վեր ելեք, 
Հոն Անոր ոտքերն գրկած՝ 
Այս անհուն հրաշքն տեսեք, 
Աստծո որդին զոհված: 
«Կատարյալ է»,- կգոչե, 
Սորվեցեք մեռնիլ Անկե: 
4. Գերեզմանը մոտեցեք, 
Ուր մարմինը թաղվեցավ, 
Այն դատարկ է, նայեցեք, 
Ո՞վ ըզ Տերն անկե առավ: 
Տերն հարյավ ու համբարձավ, 
Մեզ ալ նույն խոստմունք տվավ: 
>>> 
