import re
# text = "The [cat\n\n\n\nasdfasdasdasdas] is in the [hat]. The [cat] is cute."
# x = re.findall("\[(.*?)\]", text, re.DOTALL)
# print(x) # this will return a list containing ['cat', 'hat', 'cat']


song_doc = '[start:song]\n88\n     ՀԵ 170, Էլմ. 549, Եբր. 4։9,11\n Թափառական հոգիս,\nԴադրե՛. այս աշխարհիս\nՄեկ բևեռեն մինչև ի մյուսն\nՀանգիստ չկա քեզի։\n\n2. Տե՛ս Աստծո տապան,\nՆայե՛ այն բաց դռան,\nՇուտով մտի՛ր, հոն բնակե՛,\nՈւնայն հույսերդ ձգե՛։\n\n3. Հանգիստ պիտի ըլլաս\nԵվ շատ ուրախանաս,\nԱմեն երջանկությամբ լեցվիս,\nՏէրոջմով փրկվիս։\n\n4. Ո՜վ անհանգիստ հոգիս,\nԴադրե՛. այս աշխարհիս\nՄեկ բևեռեն մինչև ի մյուսն\nՀանգիստ չկա քեզի։\n[end:song]\n\n\n\n\n\n\n[start:song]\n598\n1. Տե՜ր Հիսուս, արի՛, Փրկիչ աշխարհի,\nԴու ես հավերժ սիրո աղբյուր,\nԴու` ճշմարիտ կյանք, մեր Հովիվ բարի,\nՀաց հանապազօր այսօր տուր:\n\nԱղաչում եմ, Հիսո՜ւս, արի՛,\nՔո Սուրբ Հոգով մխիթարի՜ր,\nՄեր սրտերում թագավորի՛ր,\nԱրի՜, արի՜:\n\n2. Տեր Հիսուս սեր է, Նա մեզ սիրում է,\nՃշմարիտ լույսը Նա է,\nԼույս տվեց Նա մեր սրտերին խավար,\nԴարձել է մեր կյանքի արև:\n\nԱղաչում եմ, Հիսո՜ւս, արի՛,\nՔո Սուրբ Հոգով մխիթարի՜ր,\nՄեր սրտերում թագավորի՛ր,\nԱրի՜, արի՜:\n\n3. Փա՜ռք Տեր Հիսուսին` աշխարհի լույսին՝\nԱնսահման մեծ սիրո համար,\nՍիրո կամուրջն է Նա մեր փրկության,\nՆրանով քայլենք անվարան:\n\nԱղաչում եմ, Հիսո՜ւս, արի՛,\nՔո Սուրբ Հոգով մխիթարի՜ր,\nՄեր սրտերում թագավորի՛ր,\nԱրի՜, արի՜:\n\n[end:song]\n\n[start:song]\n196\n1. Եթե կուզես Տերը տեսնել,\nԻր քաղցր ձայնը ունկնդրել,\nԵթե խրատ կուզես առնել,\nԿամ քո վերքերը դարմանել։\n\n2. Թե իմաստուն կուզես ըլլալ,\nԿամ երկինքեն շնորհք ստանալ,\nԿամ Հոր օրհնությունն ունենալ,\nԿամ թե Տերոջ կամքը գիտնալ։\n\n3. Եթե կուզես ճամփան գտնել,\nԵրջանկության վայրը մտնել,\nՊետք է քեզի արթուն կենալ\nԵվ Ավետարանը կարդալ։\n[end:song]\n\n\n'

matches = re.findall("\[start:song](.*?)\[end:song]",song_doc,re.DOTALL)

# for match in matches:
#     print(match)
    
    
song_doc ='\n770\n1 Տեր Հիսուս արի Փրկիչն աշխարհի\nԴու ես հավետ սիրո աղբյուր \nԴու ճշմարիտ կյանք մեր հովիվ բարի\nՀացն հանապազօր այսօր  տուր\n\nկրկ: Աղաչում եմ Հիսուս արի\n        Քո Սուրբ Հոգով մխիթարի \n        Մեր սրտերում թագավորիր\n        Արի-արի։\n\n2 Տեր Հիսուս սեր է մեզ շատ կսիրե\nՃշմարիտ լույսը Նա է \nԼույս տվեց Նա մեր սրտերին խավար\nԴարձել է մեր կյանքի ար\nև:\n\nկրկ: Աղաչում եմ Հիսուս արի\n        Քո Սուրբ Հոգով մխիթարի \n        Մեր սրտերում թագավորիր\n        Արի-արի։\n\n3 Մեր Տեր Հիսուսը աշխարհի լույսը\nԱնսահման մեծ սիրո համար\nՍիրո կամուրջ է Նա մեր փրկության\nՆրանով քայլենք անվարան։\n\nկրկ: Աղաչում եմ Հիսուս արի\n        Քո Սուրբ Հոգով մխիթարի \n        Մեր սրտերում թագավորիր\n        Արի-արի։\n\n\n'
# song_doc = '\n298\n1.Ահա մենք մեր ուրախ երգերով\nՀիսուս Քեզ ենք գովում․\nՔո անունը միշտ հիշելով\nՑնծում, ուրախանում։\n\nՄարդիկ դուք էլ մեզ միացեք,\nէմմանուելին երգենք,\nՆրա անունը հիշելով\nԱստծով ուրախ լինենք։\n\n2. Մեր սրտերը միշտ ցնծում է\nՀիսուսի անունով,\nՍուրբ Հոգու օրհնության ներքո\nՀոդու սուրբ երգերով։\n\n3. Պիտի երգենք մենք շարունակ\nՀայր Աստծո առջև,\nՈւնենք մենք մի մեծ նպատակ\nԱստծո Որդուն պաշտենք։\n\n'
song_doc = '\n448\nՀիսո՛ւս, Քեզ բարձրացնում եմ,\nՀիսո՛ւս, երկրպագում եմ Քեզ,\nՈ՜վ մեր Տեր, ո՜վ մեր Թագավոր,\nՄիայն Դու արժանի ես անսահման փառքի։\n\xa0 \xa0 \xa0 Օրհնյալ է ներկայությունդ,\n\xa0 \xa0 \xa0 Սիրուն և անուշահոտ,\n\xa0 \xa0 \xa0 Սրտանց, ո՜վ Տեր, երգում եմ,\n\xa0 \xa0 \xa0 Թե` միայն Դու արժանի ես օրհնության։\n\nՀավերժական Թագավորին (2)\nՈր անեղծ, աներևույթ է,\nՄիմիայն Տեր Աստծուն\nԵրգենք փառք ու պատիվ (3)\nՀավիտյանս հավիտենից։ Ամեն։\n\n'

#"Old" song title finder

tab = re.findall("\n.+", song_doc)
print(tab[1])
text = tab[1]
# Use re.sub() to remove "1." and "," from the text
text = re.sub(r"1.", "", text)
text = re.sub(r",", "", text)
text = re.sub(r"\n", "", text)
print(text)